app/views/questions/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
	    <li><%= @questionMoreVisited.visits %> visitas - <%= @questionMoreVisited.votes %> votos</li>
	    <li>Creado por: <%= User.find(@questionMoreVisited.user_id).email %> </li>