app/views/questions/show.html.erb

          <% if User.exists?(@question.user_id) %>
            <%= User.find(@question.user_id).name %> - Puntos:
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 7], ["LIMIT", 1]]

                      <ul class="list-group">
                        <% answer.answer_comments.each do |comentario| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 2]]