app/controllers/questions_controller.rb

    def index

	      if (params[:sort].present?)

		        if (params[:sort] == "fecha")

		            @questions = Question.porfecha

		        elsif (params[:sort] == "votos")

			          @questions = Question.porvotos

		        elsif (params[:sort] == "visitas")

			          @questions = Question.porvisitas

		        elsif (params[:sort] == "respuestasmayor")

			          @questions = Question.porrespuestasmayor

		        elsif (params[:sort] == "respuestasmenor")

			          @questions = Question.porrespuestasmenor

            else

                @questions = Question.all
---
SELECT  "questions".* FROM "questions" ORDER BY created_at desc, visits DESC LIMIT $1  [["LIMIT", 1]]