app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "question_votes".* FROM "question_votes" WHERE "question_votes"."user_id" = $1 AND "question_votes"."question_id" = $2 ORDER BY "question_votes"."id" ASC LIMIT $3  [["user_id", 7], ["question_id", 5], ["LIMIT", 1]]
DELETE FROM "question_votes" WHERE "question_votes"."id" = $1  [["id", 1]]
UPDATE "questions" SET "votes" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["votes", 4], ["updated_at", "2017-11-16 22:52:43.507823"], ["id", 5]]
---
    def desvotar

        @question = Question.find(params[:id])

        @vote = QuestionVote.where(user_id: current_user.id, question_id: @question.id).first

        @vote.destroy

        @question.votes -= 1

        @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "question_votes" ("user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 7], ["question_id", 5], ["created_at", "2017-11-16 22:18:13.265348"], ["updated_at", "2017-11-16 22:18:13.265348"]]
UPDATE "questions" SET "votes" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["votes", 1], ["updated_at", "2017-11-16 22:18:13.284886"], ["id", 5]]
---
    def votar

        @question = Question.find(params[:id])

        QuestionVote.create(user_id: current_user.id, question_id: @question.id)

        @question.votes += 1

        @question.save

SELECT  "tags".* FROM "tags" ORDER BY usos DESC LIMIT $1  [["LIMIT", 5]]
---
    def index

	if (params[:sort].present?)
		if (params[:sort] == "fecha")
			@questions = Question.porfecha
		end
		if (params[:sort] == "votos")
			@questions = Question.porvotos
		end
		if (params[:sort] == "visitas")
			@questions = Question.porvisitas
		end
	else
		@questions = Question.porfecha
	end

	@questionMoreVisited = Question.masvisitada

	@questionMoreVoted = Question.masvotada

	@tags = Tag.order("usos DESC").first(5)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 ORDER BY created_at desc LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "questions" SET "visits" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["visits", 1], ["updated_at", "2017-11-15 02:21:07.681826"], ["id", 1]]
---
    def show

        @question = Question.find(params[:id])

	@question.visits += 1

	@question.save

INSERT INTO "questions" ("user_id", "title", "content", "visits", "votes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 7], ["title", "preguntando?"], ["content", "adsasd"], ["visits", 0], ["votes", 0], ["created_at", "2017-11-15 02:30:23.559763"], ["updated_at", "2017-11-15 02:30:23.559763"]]
---
    def create

    	@question = Question.create(user_id: current_user.id, visits: 0, votes: 0, title: params[:question][:title], content: params[:question][:content])