app/controllers/tags_controller.rb

    def create

        @tag = Tag.new

        @tag.usos = 0

        @tag.content = (((params[:tag][:content].downcase).titleize).delete(' '))       # Twitter hashtag style

        if  (not(Tag.exists?(content: @tag.content)))

            if ((@tag.content.length) < 4)

                flash[:error] = "La etiqueta que intentó crear tenia menos de 4 caracteres."

                render :new

            elsif ((@tag.content.length) > 16)

                flash[:error] = "La etiqueta que intentó crear tenia mas de 16 caracteres."

                render :new

            else

                if (@tag.save)
---
SELECT  1 AS one FROM "tags" WHERE "tags"."content" = $1 LIMIT $2  [["content", "dgmjyhgdmnjhydtg"], ["LIMIT", 1]]
INSERT INTO "tags" ("content", "usos", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "xghm hdtjn"], ["usos", 0], ["created_at", "2017-11-14 19:44:10.753453"], ["updated_at", "2017-11-14 19:44:10.753453"]]